stress/stressTestPost.yml
config:
  target: 'http://127.0.0.1:3002'
  processor: './stressTest.js'
  phases:
    - duration: 60
      arrivalRate: 2
    - duration: 120
      arrivalRate: 2
      rampTo: 25
scenarios:
  - name: 'POST test'
    flow:
    - loop:
      - function: 'randomData'
      - post:
          url: '/reservation'
          json:
            restId: '{{ restId }}'
            name: '{{ name }}'
            guests: '{{ guests }}'
            time: '{{ time }}'
      count: 50